read_verilog -sv /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/public/LSV04_itc99_b11/rtl/design.v
hierarchy -check -top b11
synth -top b11 -flatten -noabc
dfflibmap -liberty /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/lib/nangate45/NangateOpenCellLibrary_typical.lib
abc -liberty /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/lib/nangate45/NangateOpenCellLibrary_typical.lib -script "+strash; if -K 6 -g -C 8; &get -n; &dch -f; &nf -D 10000; &put"
clean
stat -liberty /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/lib/nangate45/NangateOpenCellLibrary_typical.lib
setundef -zero
splitnets -driver
clean
write_verilog -noattr -noexpr /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/reports/reference_runs/yosys_p2/LSV04/netlist.v
