###################################################################

# Created by write_sdc on Sun Jul  5 15:01:41 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_area 0
set_load -pin_load 1 [get_ports {o_quotient_out[31]}]
set_load -pin_load 1 [get_ports {o_quotient_out[30]}]
set_load -pin_load 1 [get_ports {o_quotient_out[29]}]
set_load -pin_load 1 [get_ports {o_quotient_out[28]}]
set_load -pin_load 1 [get_ports {o_quotient_out[27]}]
set_load -pin_load 1 [get_ports {o_quotient_out[26]}]
set_load -pin_load 1 [get_ports {o_quotient_out[25]}]
set_load -pin_load 1 [get_ports {o_quotient_out[24]}]
set_load -pin_load 1 [get_ports {o_quotient_out[23]}]
set_load -pin_load 1 [get_ports {o_quotient_out[22]}]
set_load -pin_load 1 [get_ports {o_quotient_out[21]}]
set_load -pin_load 1 [get_ports {o_quotient_out[20]}]
set_load -pin_load 1 [get_ports {o_quotient_out[19]}]
set_load -pin_load 1 [get_ports {o_quotient_out[18]}]
set_load -pin_load 1 [get_ports {o_quotient_out[17]}]
set_load -pin_load 1 [get_ports {o_quotient_out[16]}]
set_load -pin_load 1 [get_ports {o_quotient_out[15]}]
set_load -pin_load 1 [get_ports {o_quotient_out[14]}]
set_load -pin_load 1 [get_ports {o_quotient_out[13]}]
set_load -pin_load 1 [get_ports {o_quotient_out[12]}]
set_load -pin_load 1 [get_ports {o_quotient_out[11]}]
set_load -pin_load 1 [get_ports {o_quotient_out[10]}]
set_load -pin_load 1 [get_ports {o_quotient_out[9]}]
set_load -pin_load 1 [get_ports {o_quotient_out[8]}]
set_load -pin_load 1 [get_ports {o_quotient_out[7]}]
set_load -pin_load 1 [get_ports {o_quotient_out[6]}]
set_load -pin_load 1 [get_ports {o_quotient_out[5]}]
set_load -pin_load 1 [get_ports {o_quotient_out[4]}]
set_load -pin_load 1 [get_ports {o_quotient_out[3]}]
set_load -pin_load 1 [get_ports {o_quotient_out[2]}]
set_load -pin_load 1 [get_ports {o_quotient_out[1]}]
set_load -pin_load 1 [get_ports {o_quotient_out[0]}]
set_load -pin_load 1 [get_ports o_complete]
set_load -pin_load 1 [get_ports o_overflow]
create_clock [get_ports i_clk]  -period 100  -waveform {0 50}
set_input_delay -clock i_clk  1  [get_ports i_clk]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[31]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[30]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[29]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[28]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[27]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[26]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[25]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[24]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[23]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[22]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[21]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[20]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[19]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[18]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[17]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[16]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[15]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[14]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[13]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[12]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[11]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[10]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[9]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[8]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[7]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[6]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[5]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[4]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[3]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[2]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[1]}]
set_input_delay -clock i_clk  1  [get_ports {i_dividend[0]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[31]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[30]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[29]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[28]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[27]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[26]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[25]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[24]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[23]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[22]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[21]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[20]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[19]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[18]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[17]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[16]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[15]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[14]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[13]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[12]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[11]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[10]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[9]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[8]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[7]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[6]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[5]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[4]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[3]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[2]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[1]}]
set_input_delay -clock i_clk  1  [get_ports {i_divisor[0]}]
set_input_delay -clock i_clk  1  [get_ports i_start]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[31]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[30]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[29]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[28]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[27]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[26]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[25]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[24]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[23]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[22]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[21]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[20]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[19]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[18]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[17]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[16]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[15]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[14]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[13]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[12]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[11]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[10]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[9]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[8]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[7]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[6]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[5]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[4]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[3]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[2]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[1]}]
set_output_delay -clock i_clk  1  [get_ports {o_quotient_out[0]}]
set_output_delay -clock i_clk  1  [get_ports o_complete]
set_output_delay -clock i_clk  1  [get_ports o_overflow]
set_drive 0.1  [get_ports {i_dividend[31]}]
set_drive 0.1  [get_ports {i_dividend[30]}]
set_drive 0.1  [get_ports {i_dividend[29]}]
set_drive 0.1  [get_ports {i_dividend[28]}]
set_drive 0.1  [get_ports {i_dividend[27]}]
set_drive 0.1  [get_ports {i_dividend[26]}]
set_drive 0.1  [get_ports {i_dividend[25]}]
set_drive 0.1  [get_ports {i_dividend[24]}]
set_drive 0.1  [get_ports {i_dividend[23]}]
set_drive 0.1  [get_ports {i_dividend[22]}]
set_drive 0.1  [get_ports {i_dividend[21]}]
set_drive 0.1  [get_ports {i_dividend[20]}]
set_drive 0.1  [get_ports {i_dividend[19]}]
set_drive 0.1  [get_ports {i_dividend[18]}]
set_drive 0.1  [get_ports {i_dividend[17]}]
set_drive 0.1  [get_ports {i_dividend[16]}]
set_drive 0.1  [get_ports {i_dividend[15]}]
set_drive 0.1  [get_ports {i_dividend[14]}]
set_drive 0.1  [get_ports {i_dividend[13]}]
set_drive 0.1  [get_ports {i_dividend[12]}]
set_drive 0.1  [get_ports {i_dividend[11]}]
set_drive 0.1  [get_ports {i_dividend[10]}]
set_drive 0.1  [get_ports {i_dividend[9]}]
set_drive 0.1  [get_ports {i_dividend[8]}]
set_drive 0.1  [get_ports {i_dividend[7]}]
set_drive 0.1  [get_ports {i_dividend[6]}]
set_drive 0.1  [get_ports {i_dividend[5]}]
set_drive 0.1  [get_ports {i_dividend[4]}]
set_drive 0.1  [get_ports {i_dividend[3]}]
set_drive 0.1  [get_ports {i_dividend[2]}]
set_drive 0.1  [get_ports {i_dividend[1]}]
set_drive 0.1  [get_ports {i_dividend[0]}]
set_drive 0.1  [get_ports {i_divisor[31]}]
set_drive 0.1  [get_ports {i_divisor[30]}]
set_drive 0.1  [get_ports {i_divisor[29]}]
set_drive 0.1  [get_ports {i_divisor[28]}]
set_drive 0.1  [get_ports {i_divisor[27]}]
set_drive 0.1  [get_ports {i_divisor[26]}]
set_drive 0.1  [get_ports {i_divisor[25]}]
set_drive 0.1  [get_ports {i_divisor[24]}]
set_drive 0.1  [get_ports {i_divisor[23]}]
set_drive 0.1  [get_ports {i_divisor[22]}]
set_drive 0.1  [get_ports {i_divisor[21]}]
set_drive 0.1  [get_ports {i_divisor[20]}]
set_drive 0.1  [get_ports {i_divisor[19]}]
set_drive 0.1  [get_ports {i_divisor[18]}]
set_drive 0.1  [get_ports {i_divisor[17]}]
set_drive 0.1  [get_ports {i_divisor[16]}]
set_drive 0.1  [get_ports {i_divisor[15]}]
set_drive 0.1  [get_ports {i_divisor[14]}]
set_drive 0.1  [get_ports {i_divisor[13]}]
set_drive 0.1  [get_ports {i_divisor[12]}]
set_drive 0.1  [get_ports {i_divisor[11]}]
set_drive 0.1  [get_ports {i_divisor[10]}]
set_drive 0.1  [get_ports {i_divisor[9]}]
set_drive 0.1  [get_ports {i_divisor[8]}]
set_drive 0.1  [get_ports {i_divisor[7]}]
set_drive 0.1  [get_ports {i_divisor[6]}]
set_drive 0.1  [get_ports {i_divisor[5]}]
set_drive 0.1  [get_ports {i_divisor[4]}]
set_drive 0.1  [get_ports {i_divisor[3]}]
set_drive 0.1  [get_ports {i_divisor[2]}]
set_drive 0.1  [get_ports {i_divisor[1]}]
set_drive 0.1  [get_ports {i_divisor[0]}]
set_drive 0.1  [get_ports i_start]
set_drive 0.1  [get_ports i_clk]
