###################################################################

# Created by write_sdc on Sun Jul  5 15:01:48 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_area 0
set_load -pin_load 1 [get_ports done_o]
set_load -pin_load 1 [get_ports {mcand_o[31]}]
set_load -pin_load 1 [get_ports {mcand_o[30]}]
set_load -pin_load 1 [get_ports {mcand_o[29]}]
set_load -pin_load 1 [get_ports {mcand_o[28]}]
set_load -pin_load 1 [get_ports {mcand_o[27]}]
set_load -pin_load 1 [get_ports {mcand_o[26]}]
set_load -pin_load 1 [get_ports {mcand_o[25]}]
set_load -pin_load 1 [get_ports {mcand_o[24]}]
set_load -pin_load 1 [get_ports {mcand_o[23]}]
set_load -pin_load 1 [get_ports {mcand_o[22]}]
set_load -pin_load 1 [get_ports {mcand_o[21]}]
set_load -pin_load 1 [get_ports {mcand_o[20]}]
set_load -pin_load 1 [get_ports {mcand_o[19]}]
set_load -pin_load 1 [get_ports {mcand_o[18]}]
set_load -pin_load 1 [get_ports {mcand_o[17]}]
set_load -pin_load 1 [get_ports {mcand_o[16]}]
set_load -pin_load 1 [get_ports {mcand_o[15]}]
set_load -pin_load 1 [get_ports {mcand_o[14]}]
set_load -pin_load 1 [get_ports {mcand_o[13]}]
set_load -pin_load 1 [get_ports {mcand_o[12]}]
set_load -pin_load 1 [get_ports {mcand_o[11]}]
set_load -pin_load 1 [get_ports {mcand_o[10]}]
set_load -pin_load 1 [get_ports {mcand_o[9]}]
set_load -pin_load 1 [get_ports {mcand_o[8]}]
set_load -pin_load 1 [get_ports {mcand_o[7]}]
set_load -pin_load 1 [get_ports {mcand_o[6]}]
set_load -pin_load 1 [get_ports {mcand_o[5]}]
set_load -pin_load 1 [get_ports {mcand_o[4]}]
set_load -pin_load 1 [get_ports {mcand_o[3]}]
set_load -pin_load 1 [get_ports {mcand_o[2]}]
set_load -pin_load 1 [get_ports {mcand_o[1]}]
set_load -pin_load 1 [get_ports {mcand_o[0]}]
set_load -pin_load 1 [get_ports {mplier_o[31]}]
set_load -pin_load 1 [get_ports {mplier_o[30]}]
set_load -pin_load 1 [get_ports {mplier_o[29]}]
set_load -pin_load 1 [get_ports {mplier_o[28]}]
set_load -pin_load 1 [get_ports {mplier_o[27]}]
set_load -pin_load 1 [get_ports {mplier_o[26]}]
set_load -pin_load 1 [get_ports {mplier_o[25]}]
set_load -pin_load 1 [get_ports {mplier_o[24]}]
set_load -pin_load 1 [get_ports {mplier_o[23]}]
set_load -pin_load 1 [get_ports {mplier_o[22]}]
set_load -pin_load 1 [get_ports {mplier_o[21]}]
set_load -pin_load 1 [get_ports {mplier_o[20]}]
set_load -pin_load 1 [get_ports {mplier_o[19]}]
set_load -pin_load 1 [get_ports {mplier_o[18]}]
set_load -pin_load 1 [get_ports {mplier_o[17]}]
set_load -pin_load 1 [get_ports {mplier_o[16]}]
set_load -pin_load 1 [get_ports {mplier_o[15]}]
set_load -pin_load 1 [get_ports {mplier_o[14]}]
set_load -pin_load 1 [get_ports {mplier_o[13]}]
set_load -pin_load 1 [get_ports {mplier_o[12]}]
set_load -pin_load 1 [get_ports {mplier_o[11]}]
set_load -pin_load 1 [get_ports {mplier_o[10]}]
set_load -pin_load 1 [get_ports {mplier_o[9]}]
set_load -pin_load 1 [get_ports {mplier_o[8]}]
set_load -pin_load 1 [get_ports {mplier_o[7]}]
set_load -pin_load 1 [get_ports {mplier_o[6]}]
set_load -pin_load 1 [get_ports {mplier_o[5]}]
set_load -pin_load 1 [get_ports {mplier_o[4]}]
set_load -pin_load 1 [get_ports {mplier_o[3]}]
set_load -pin_load 1 [get_ports {mplier_o[2]}]
set_load -pin_load 1 [get_ports {mplier_o[1]}]
set_load -pin_load 1 [get_ports {mplier_o[0]}]
set_load -pin_load 1 [get_ports {prod_o[31]}]
set_load -pin_load 1 [get_ports {prod_o[30]}]
set_load -pin_load 1 [get_ports {prod_o[29]}]
set_load -pin_load 1 [get_ports {prod_o[28]}]
set_load -pin_load 1 [get_ports {prod_o[27]}]
set_load -pin_load 1 [get_ports {prod_o[26]}]
set_load -pin_load 1 [get_ports {prod_o[25]}]
set_load -pin_load 1 [get_ports {prod_o[24]}]
set_load -pin_load 1 [get_ports {prod_o[23]}]
set_load -pin_load 1 [get_ports {prod_o[22]}]
set_load -pin_load 1 [get_ports {prod_o[21]}]
set_load -pin_load 1 [get_ports {prod_o[20]}]
set_load -pin_load 1 [get_ports {prod_o[19]}]
set_load -pin_load 1 [get_ports {prod_o[18]}]
set_load -pin_load 1 [get_ports {prod_o[17]}]
set_load -pin_load 1 [get_ports {prod_o[16]}]
set_load -pin_load 1 [get_ports {prod_o[15]}]
set_load -pin_load 1 [get_ports {prod_o[14]}]
set_load -pin_load 1 [get_ports {prod_o[13]}]
set_load -pin_load 1 [get_ports {prod_o[12]}]
set_load -pin_load 1 [get_ports {prod_o[11]}]
set_load -pin_load 1 [get_ports {prod_o[10]}]
set_load -pin_load 1 [get_ports {prod_o[9]}]
set_load -pin_load 1 [get_ports {prod_o[8]}]
set_load -pin_load 1 [get_ports {prod_o[7]}]
set_load -pin_load 1 [get_ports {prod_o[6]}]
set_load -pin_load 1 [get_ports {prod_o[5]}]
set_load -pin_load 1 [get_ports {prod_o[4]}]
set_load -pin_load 1 [get_ports {prod_o[3]}]
set_load -pin_load 1 [get_ports {prod_o[2]}]
set_load -pin_load 1 [get_ports {prod_o[1]}]
set_load -pin_load 1 [get_ports {prod_o[0]}]
create_clock [get_ports clk]  -period 100  -waveform {0 50}
set_false_path   -from [get_ports rst]
set_input_delay -clock clk  1  [get_ports clk]
set_input_delay -clock clk  1  [get_ports rst]
set_input_delay -clock clk  1  [get_ports en]
set_input_delay -clock clk  1  [get_ports {mcand_i[31]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[30]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[29]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[28]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[27]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[26]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[25]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[24]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[23]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[22]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[21]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[20]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[19]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[18]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[17]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[16]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[15]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[14]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[13]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[12]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[11]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[10]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[9]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[8]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[7]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[6]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[5]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[4]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[3]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[2]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[1]}]
set_input_delay -clock clk  1  [get_ports {mcand_i[0]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[31]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[30]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[29]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[28]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[27]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[26]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[25]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[24]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[23]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[22]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[21]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[20]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[19]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[18]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[17]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[16]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[15]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[14]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[13]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[12]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[11]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[10]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[9]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[8]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[7]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[6]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[5]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[4]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[3]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[2]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[1]}]
set_input_delay -clock clk  1  [get_ports {mplier_i[0]}]
set_input_delay -clock clk  1  [get_ports {prod_i[31]}]
set_input_delay -clock clk  1  [get_ports {prod_i[30]}]
set_input_delay -clock clk  1  [get_ports {prod_i[29]}]
set_input_delay -clock clk  1  [get_ports {prod_i[28]}]
set_input_delay -clock clk  1  [get_ports {prod_i[27]}]
set_input_delay -clock clk  1  [get_ports {prod_i[26]}]
set_input_delay -clock clk  1  [get_ports {prod_i[25]}]
set_input_delay -clock clk  1  [get_ports {prod_i[24]}]
set_input_delay -clock clk  1  [get_ports {prod_i[23]}]
set_input_delay -clock clk  1  [get_ports {prod_i[22]}]
set_input_delay -clock clk  1  [get_ports {prod_i[21]}]
set_input_delay -clock clk  1  [get_ports {prod_i[20]}]
set_input_delay -clock clk  1  [get_ports {prod_i[19]}]
set_input_delay -clock clk  1  [get_ports {prod_i[18]}]
set_input_delay -clock clk  1  [get_ports {prod_i[17]}]
set_input_delay -clock clk  1  [get_ports {prod_i[16]}]
set_input_delay -clock clk  1  [get_ports {prod_i[15]}]
set_input_delay -clock clk  1  [get_ports {prod_i[14]}]
set_input_delay -clock clk  1  [get_ports {prod_i[13]}]
set_input_delay -clock clk  1  [get_ports {prod_i[12]}]
set_input_delay -clock clk  1  [get_ports {prod_i[11]}]
set_input_delay -clock clk  1  [get_ports {prod_i[10]}]
set_input_delay -clock clk  1  [get_ports {prod_i[9]}]
set_input_delay -clock clk  1  [get_ports {prod_i[8]}]
set_input_delay -clock clk  1  [get_ports {prod_i[7]}]
set_input_delay -clock clk  1  [get_ports {prod_i[6]}]
set_input_delay -clock clk  1  [get_ports {prod_i[5]}]
set_input_delay -clock clk  1  [get_ports {prod_i[4]}]
set_input_delay -clock clk  1  [get_ports {prod_i[3]}]
set_input_delay -clock clk  1  [get_ports {prod_i[2]}]
set_input_delay -clock clk  1  [get_ports {prod_i[1]}]
set_input_delay -clock clk  1  [get_ports {prod_i[0]}]
set_output_delay -clock clk  1  [get_ports done_o]
set_output_delay -clock clk  1  [get_ports {mcand_o[31]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[30]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[29]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[28]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[27]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[26]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[25]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[24]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[23]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[22]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[21]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[20]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[19]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[18]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[17]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[16]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[15]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[14]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[13]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[12]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[11]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[10]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[9]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[8]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[7]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[6]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[5]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[4]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[3]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[2]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[1]}]
set_output_delay -clock clk  1  [get_ports {mcand_o[0]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[31]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[30]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[29]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[28]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[27]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[26]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[25]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[24]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[23]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[22]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[21]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[20]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[19]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[18]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[17]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[16]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[15]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[14]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[13]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[12]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[11]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[10]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[9]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[8]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[7]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[6]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[5]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[4]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[3]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[2]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[1]}]
set_output_delay -clock clk  1  [get_ports {mplier_o[0]}]
set_output_delay -clock clk  1  [get_ports {prod_o[31]}]
set_output_delay -clock clk  1  [get_ports {prod_o[30]}]
set_output_delay -clock clk  1  [get_ports {prod_o[29]}]
set_output_delay -clock clk  1  [get_ports {prod_o[28]}]
set_output_delay -clock clk  1  [get_ports {prod_o[27]}]
set_output_delay -clock clk  1  [get_ports {prod_o[26]}]
set_output_delay -clock clk  1  [get_ports {prod_o[25]}]
set_output_delay -clock clk  1  [get_ports {prod_o[24]}]
set_output_delay -clock clk  1  [get_ports {prod_o[23]}]
set_output_delay -clock clk  1  [get_ports {prod_o[22]}]
set_output_delay -clock clk  1  [get_ports {prod_o[21]}]
set_output_delay -clock clk  1  [get_ports {prod_o[20]}]
set_output_delay -clock clk  1  [get_ports {prod_o[19]}]
set_output_delay -clock clk  1  [get_ports {prod_o[18]}]
set_output_delay -clock clk  1  [get_ports {prod_o[17]}]
set_output_delay -clock clk  1  [get_ports {prod_o[16]}]
set_output_delay -clock clk  1  [get_ports {prod_o[15]}]
set_output_delay -clock clk  1  [get_ports {prod_o[14]}]
set_output_delay -clock clk  1  [get_ports {prod_o[13]}]
set_output_delay -clock clk  1  [get_ports {prod_o[12]}]
set_output_delay -clock clk  1  [get_ports {prod_o[11]}]
set_output_delay -clock clk  1  [get_ports {prod_o[10]}]
set_output_delay -clock clk  1  [get_ports {prod_o[9]}]
set_output_delay -clock clk  1  [get_ports {prod_o[8]}]
set_output_delay -clock clk  1  [get_ports {prod_o[7]}]
set_output_delay -clock clk  1  [get_ports {prod_o[6]}]
set_output_delay -clock clk  1  [get_ports {prod_o[5]}]
set_output_delay -clock clk  1  [get_ports {prod_o[4]}]
set_output_delay -clock clk  1  [get_ports {prod_o[3]}]
set_output_delay -clock clk  1  [get_ports {prod_o[2]}]
set_output_delay -clock clk  1  [get_ports {prod_o[1]}]
set_output_delay -clock clk  1  [get_ports {prod_o[0]}]
set_drive 0.1  [get_ports clk]
set_drive 0.1  [get_ports rst]
set_drive 0.1  [get_ports en]
set_drive 0.1  [get_ports {mcand_i[31]}]
set_drive 0.1  [get_ports {mcand_i[30]}]
set_drive 0.1  [get_ports {mcand_i[29]}]
set_drive 0.1  [get_ports {mcand_i[28]}]
set_drive 0.1  [get_ports {mcand_i[27]}]
set_drive 0.1  [get_ports {mcand_i[26]}]
set_drive 0.1  [get_ports {mcand_i[25]}]
set_drive 0.1  [get_ports {mcand_i[24]}]
set_drive 0.1  [get_ports {mcand_i[23]}]
set_drive 0.1  [get_ports {mcand_i[22]}]
set_drive 0.1  [get_ports {mcand_i[21]}]
set_drive 0.1  [get_ports {mcand_i[20]}]
set_drive 0.1  [get_ports {mcand_i[19]}]
set_drive 0.1  [get_ports {mcand_i[18]}]
set_drive 0.1  [get_ports {mcand_i[17]}]
set_drive 0.1  [get_ports {mcand_i[16]}]
set_drive 0.1  [get_ports {mcand_i[15]}]
set_drive 0.1  [get_ports {mcand_i[14]}]
set_drive 0.1  [get_ports {mcand_i[13]}]
set_drive 0.1  [get_ports {mcand_i[12]}]
set_drive 0.1  [get_ports {mcand_i[11]}]
set_drive 0.1  [get_ports {mcand_i[10]}]
set_drive 0.1  [get_ports {mcand_i[9]}]
set_drive 0.1  [get_ports {mcand_i[8]}]
set_drive 0.1  [get_ports {mcand_i[7]}]
set_drive 0.1  [get_ports {mcand_i[6]}]
set_drive 0.1  [get_ports {mcand_i[5]}]
set_drive 0.1  [get_ports {mcand_i[4]}]
set_drive 0.1  [get_ports {mcand_i[3]}]
set_drive 0.1  [get_ports {mcand_i[2]}]
set_drive 0.1  [get_ports {mcand_i[1]}]
set_drive 0.1  [get_ports {mcand_i[0]}]
set_drive 0.1  [get_ports {mplier_i[31]}]
set_drive 0.1  [get_ports {mplier_i[30]}]
set_drive 0.1  [get_ports {mplier_i[29]}]
set_drive 0.1  [get_ports {mplier_i[28]}]
set_drive 0.1  [get_ports {mplier_i[27]}]
set_drive 0.1  [get_ports {mplier_i[26]}]
set_drive 0.1  [get_ports {mplier_i[25]}]
set_drive 0.1  [get_ports {mplier_i[24]}]
set_drive 0.1  [get_ports {mplier_i[23]}]
set_drive 0.1  [get_ports {mplier_i[22]}]
set_drive 0.1  [get_ports {mplier_i[21]}]
set_drive 0.1  [get_ports {mplier_i[20]}]
set_drive 0.1  [get_ports {mplier_i[19]}]
set_drive 0.1  [get_ports {mplier_i[18]}]
set_drive 0.1  [get_ports {mplier_i[17]}]
set_drive 0.1  [get_ports {mplier_i[16]}]
set_drive 0.1  [get_ports {mplier_i[15]}]
set_drive 0.1  [get_ports {mplier_i[14]}]
set_drive 0.1  [get_ports {mplier_i[13]}]
set_drive 0.1  [get_ports {mplier_i[12]}]
set_drive 0.1  [get_ports {mplier_i[11]}]
set_drive 0.1  [get_ports {mplier_i[10]}]
set_drive 0.1  [get_ports {mplier_i[9]}]
set_drive 0.1  [get_ports {mplier_i[8]}]
set_drive 0.1  [get_ports {mplier_i[7]}]
set_drive 0.1  [get_ports {mplier_i[6]}]
set_drive 0.1  [get_ports {mplier_i[5]}]
set_drive 0.1  [get_ports {mplier_i[4]}]
set_drive 0.1  [get_ports {mplier_i[3]}]
set_drive 0.1  [get_ports {mplier_i[2]}]
set_drive 0.1  [get_ports {mplier_i[1]}]
set_drive 0.1  [get_ports {mplier_i[0]}]
set_drive 0.1  [get_ports {prod_i[31]}]
set_drive 0.1  [get_ports {prod_i[30]}]
set_drive 0.1  [get_ports {prod_i[29]}]
set_drive 0.1  [get_ports {prod_i[28]}]
set_drive 0.1  [get_ports {prod_i[27]}]
set_drive 0.1  [get_ports {prod_i[26]}]
set_drive 0.1  [get_ports {prod_i[25]}]
set_drive 0.1  [get_ports {prod_i[24]}]
set_drive 0.1  [get_ports {prod_i[23]}]
set_drive 0.1  [get_ports {prod_i[22]}]
set_drive 0.1  [get_ports {prod_i[21]}]
set_drive 0.1  [get_ports {prod_i[20]}]
set_drive 0.1  [get_ports {prod_i[19]}]
set_drive 0.1  [get_ports {prod_i[18]}]
set_drive 0.1  [get_ports {prod_i[17]}]
set_drive 0.1  [get_ports {prod_i[16]}]
set_drive 0.1  [get_ports {prod_i[15]}]
set_drive 0.1  [get_ports {prod_i[14]}]
set_drive 0.1  [get_ports {prod_i[13]}]
set_drive 0.1  [get_ports {prod_i[12]}]
set_drive 0.1  [get_ports {prod_i[11]}]
set_drive 0.1  [get_ports {prod_i[10]}]
set_drive 0.1  [get_ports {prod_i[9]}]
set_drive 0.1  [get_ports {prod_i[8]}]
set_drive 0.1  [get_ports {prod_i[7]}]
set_drive 0.1  [get_ports {prod_i[6]}]
set_drive 0.1  [get_ports {prod_i[5]}]
set_drive 0.1  [get_ports {prod_i[4]}]
set_drive 0.1  [get_ports {prod_i[3]}]
set_drive 0.1  [get_ports {prod_i[2]}]
set_drive 0.1  [get_ports {prod_i[1]}]
set_drive 0.1  [get_ports {prod_i[0]}]
