###################################################################

# Created by write_sdc on Sun Jul  5 14:08:44 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 1 [get_ports cmd_ready]
set_load -pin_load 1 [get_ports {S_AXI_BID[0]}]
set_load -pin_load 1 [get_ports {S_AXI_BRESP[1]}]
set_load -pin_load 1 [get_ports {S_AXI_BRESP[0]}]
set_load -pin_load 1 [get_ports S_AXI_BVALID]
set_load -pin_load 1 [get_ports M_AXI_BREADY]
create_clock [get_ports ACLK]  -period 10  -waveform {0 5}
set_false_path   -from [get_ports ARESET]
set_input_delay -clock ACLK  1  [get_ports ACLK]
set_input_delay -clock ACLK  1  [get_ports ARESET]
set_input_delay -clock ACLK  1  [get_ports cmd_valid]
set_input_delay -clock ACLK  1  [get_ports cmd_split]
set_input_delay -clock ACLK  1  [get_ports {cmd_repeat[7]}]
set_input_delay -clock ACLK  1  [get_ports {cmd_repeat[6]}]
set_input_delay -clock ACLK  1  [get_ports {cmd_repeat[5]}]
set_input_delay -clock ACLK  1  [get_ports {cmd_repeat[4]}]
set_input_delay -clock ACLK  1  [get_ports {cmd_repeat[3]}]
set_input_delay -clock ACLK  1  [get_ports {cmd_repeat[2]}]
set_input_delay -clock ACLK  1  [get_ports {cmd_repeat[1]}]
set_input_delay -clock ACLK  1  [get_ports {cmd_repeat[0]}]
set_input_delay -clock ACLK  1  [get_ports {cmd_id[0]}]
set_input_delay -clock ACLK  1  [get_ports S_AXI_BREADY]
set_input_delay -clock ACLK  1  [get_ports {M_AXI_BRESP[1]}]
set_input_delay -clock ACLK  1  [get_ports {M_AXI_BRESP[0]}]
set_input_delay -clock ACLK  1  [get_ports M_AXI_BVALID]
set_output_delay -clock ACLK  1  [get_ports cmd_ready]
set_output_delay -clock ACLK  1  [get_ports {S_AXI_BID[0]}]
set_output_delay -clock ACLK  1  [get_ports {S_AXI_BRESP[1]}]
set_output_delay -clock ACLK  1  [get_ports {S_AXI_BRESP[0]}]
set_output_delay -clock ACLK  1  [get_ports S_AXI_BVALID]
set_output_delay -clock ACLK  1  [get_ports M_AXI_BREADY]
set_drive 0.1  [get_ports ARESET]
set_drive 0.1  [get_ports ACLK]
set_drive 0.1  [get_ports cmd_valid]
set_drive 0.1  [get_ports cmd_split]
set_drive 0.1  [get_ports {cmd_repeat[7]}]
set_drive 0.1  [get_ports {cmd_repeat[6]}]
set_drive 0.1  [get_ports {cmd_repeat[5]}]
set_drive 0.1  [get_ports {cmd_repeat[4]}]
set_drive 0.1  [get_ports {cmd_repeat[3]}]
set_drive 0.1  [get_ports {cmd_repeat[2]}]
set_drive 0.1  [get_ports {cmd_repeat[1]}]
set_drive 0.1  [get_ports {cmd_repeat[0]}]
set_drive 0.1  [get_ports {cmd_id[0]}]
set_drive 0.1  [get_ports S_AXI_BREADY]
set_drive 0.1  [get_ports {M_AXI_BRESP[1]}]
set_drive 0.1  [get_ports {M_AXI_BRESP[0]}]
set_drive 0.1  [get_ports M_AXI_BVALID]
