###################################################################

# Created by write_sdc on Sun Jul  5 14:11:44 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 1 [get_ports {r[31]}]
set_load -pin_load 1 [get_ports {r[30]}]
set_load -pin_load 1 [get_ports {r[29]}]
set_load -pin_load 1 [get_ports {r[28]}]
set_load -pin_load 1 [get_ports {r[27]}]
set_load -pin_load 1 [get_ports {r[26]}]
set_load -pin_load 1 [get_ports {r[25]}]
set_load -pin_load 1 [get_ports {r[24]}]
set_load -pin_load 1 [get_ports {r[23]}]
set_load -pin_load 1 [get_ports {r[22]}]
set_load -pin_load 1 [get_ports {r[21]}]
set_load -pin_load 1 [get_ports {r[20]}]
set_load -pin_load 1 [get_ports {r[19]}]
set_load -pin_load 1 [get_ports {r[18]}]
set_load -pin_load 1 [get_ports {r[17]}]
set_load -pin_load 1 [get_ports {r[16]}]
set_load -pin_load 1 [get_ports {r[15]}]
set_load -pin_load 1 [get_ports {r[14]}]
set_load -pin_load 1 [get_ports {r[13]}]
set_load -pin_load 1 [get_ports {r[12]}]
set_load -pin_load 1 [get_ports {r[11]}]
set_load -pin_load 1 [get_ports {r[10]}]
set_load -pin_load 1 [get_ports {r[9]}]
set_load -pin_load 1 [get_ports {r[8]}]
set_load -pin_load 1 [get_ports {r[7]}]
set_load -pin_load 1 [get_ports {r[6]}]
set_load -pin_load 1 [get_ports {r[5]}]
set_load -pin_load 1 [get_ports {r[4]}]
set_load -pin_load 1 [get_ports {r[3]}]
set_load -pin_load 1 [get_ports {r[2]}]
set_load -pin_load 1 [get_ports {r[1]}]
set_load -pin_load 1 [get_ports {r[0]}]
set_load -pin_load 1 [get_ports valid_o]
create_clock [get_ports sys_clk]  -period 10  -waveform {0 5}
set_false_path   -from [get_ports alu_rst]
set_input_delay -clock sys_clk  1  [get_ports sys_clk]
set_input_delay -clock sys_clk  1  [get_ports alu_rst]
set_input_delay -clock sys_clk  1  [get_ports {a[31]}]
set_input_delay -clock sys_clk  1  [get_ports {a[30]}]
set_input_delay -clock sys_clk  1  [get_ports {a[29]}]
set_input_delay -clock sys_clk  1  [get_ports {a[28]}]
set_input_delay -clock sys_clk  1  [get_ports {a[27]}]
set_input_delay -clock sys_clk  1  [get_ports {a[26]}]
set_input_delay -clock sys_clk  1  [get_ports {a[25]}]
set_input_delay -clock sys_clk  1  [get_ports {a[24]}]
set_input_delay -clock sys_clk  1  [get_ports {a[23]}]
set_input_delay -clock sys_clk  1  [get_ports {a[22]}]
set_input_delay -clock sys_clk  1  [get_ports {a[21]}]
set_input_delay -clock sys_clk  1  [get_ports {a[20]}]
set_input_delay -clock sys_clk  1  [get_ports {a[19]}]
set_input_delay -clock sys_clk  1  [get_ports {a[18]}]
set_input_delay -clock sys_clk  1  [get_ports {a[17]}]
set_input_delay -clock sys_clk  1  [get_ports {a[16]}]
set_input_delay -clock sys_clk  1  [get_ports {a[15]}]
set_input_delay -clock sys_clk  1  [get_ports {a[14]}]
set_input_delay -clock sys_clk  1  [get_ports {a[13]}]
set_input_delay -clock sys_clk  1  [get_ports {a[12]}]
set_input_delay -clock sys_clk  1  [get_ports {a[11]}]
set_input_delay -clock sys_clk  1  [get_ports {a[10]}]
set_input_delay -clock sys_clk  1  [get_ports {a[9]}]
set_input_delay -clock sys_clk  1  [get_ports {a[8]}]
set_input_delay -clock sys_clk  1  [get_ports {a[7]}]
set_input_delay -clock sys_clk  1  [get_ports {a[6]}]
set_input_delay -clock sys_clk  1  [get_ports {a[5]}]
set_input_delay -clock sys_clk  1  [get_ports {a[4]}]
set_input_delay -clock sys_clk  1  [get_ports {a[3]}]
set_input_delay -clock sys_clk  1  [get_ports {a[2]}]
set_input_delay -clock sys_clk  1  [get_ports {a[1]}]
set_input_delay -clock sys_clk  1  [get_ports {a[0]}]
set_input_delay -clock sys_clk  1  [get_ports valid_i]
set_output_delay -clock sys_clk  1  [get_ports {r[31]}]
set_output_delay -clock sys_clk  1  [get_ports {r[30]}]
set_output_delay -clock sys_clk  1  [get_ports {r[29]}]
set_output_delay -clock sys_clk  1  [get_ports {r[28]}]
set_output_delay -clock sys_clk  1  [get_ports {r[27]}]
set_output_delay -clock sys_clk  1  [get_ports {r[26]}]
set_output_delay -clock sys_clk  1  [get_ports {r[25]}]
set_output_delay -clock sys_clk  1  [get_ports {r[24]}]
set_output_delay -clock sys_clk  1  [get_ports {r[23]}]
set_output_delay -clock sys_clk  1  [get_ports {r[22]}]
set_output_delay -clock sys_clk  1  [get_ports {r[21]}]
set_output_delay -clock sys_clk  1  [get_ports {r[20]}]
set_output_delay -clock sys_clk  1  [get_ports {r[19]}]
set_output_delay -clock sys_clk  1  [get_ports {r[18]}]
set_output_delay -clock sys_clk  1  [get_ports {r[17]}]
set_output_delay -clock sys_clk  1  [get_ports {r[16]}]
set_output_delay -clock sys_clk  1  [get_ports {r[15]}]
set_output_delay -clock sys_clk  1  [get_ports {r[14]}]
set_output_delay -clock sys_clk  1  [get_ports {r[13]}]
set_output_delay -clock sys_clk  1  [get_ports {r[12]}]
set_output_delay -clock sys_clk  1  [get_ports {r[11]}]
set_output_delay -clock sys_clk  1  [get_ports {r[10]}]
set_output_delay -clock sys_clk  1  [get_ports {r[9]}]
set_output_delay -clock sys_clk  1  [get_ports {r[8]}]
set_output_delay -clock sys_clk  1  [get_ports {r[7]}]
set_output_delay -clock sys_clk  1  [get_ports {r[6]}]
set_output_delay -clock sys_clk  1  [get_ports {r[5]}]
set_output_delay -clock sys_clk  1  [get_ports {r[4]}]
set_output_delay -clock sys_clk  1  [get_ports {r[3]}]
set_output_delay -clock sys_clk  1  [get_ports {r[2]}]
set_output_delay -clock sys_clk  1  [get_ports {r[1]}]
set_output_delay -clock sys_clk  1  [get_ports {r[0]}]
set_output_delay -clock sys_clk  1  [get_ports valid_o]
set_drive 0.1  [get_ports sys_clk]
set_drive 0.1  [get_ports alu_rst]
set_drive 0.1  [get_ports {a[31]}]
set_drive 0.1  [get_ports {a[30]}]
set_drive 0.1  [get_ports {a[29]}]
set_drive 0.1  [get_ports {a[28]}]
set_drive 0.1  [get_ports {a[27]}]
set_drive 0.1  [get_ports {a[26]}]
set_drive 0.1  [get_ports {a[25]}]
set_drive 0.1  [get_ports {a[24]}]
set_drive 0.1  [get_ports {a[23]}]
set_drive 0.1  [get_ports {a[22]}]
set_drive 0.1  [get_ports {a[21]}]
set_drive 0.1  [get_ports {a[20]}]
set_drive 0.1  [get_ports {a[19]}]
set_drive 0.1  [get_ports {a[18]}]
set_drive 0.1  [get_ports {a[17]}]
set_drive 0.1  [get_ports {a[16]}]
set_drive 0.1  [get_ports {a[15]}]
set_drive 0.1  [get_ports {a[14]}]
set_drive 0.1  [get_ports {a[13]}]
set_drive 0.1  [get_ports {a[12]}]
set_drive 0.1  [get_ports {a[11]}]
set_drive 0.1  [get_ports {a[10]}]
set_drive 0.1  [get_ports {a[9]}]
set_drive 0.1  [get_ports {a[8]}]
set_drive 0.1  [get_ports {a[7]}]
set_drive 0.1  [get_ports {a[6]}]
set_drive 0.1  [get_ports {a[5]}]
set_drive 0.1  [get_ports {a[4]}]
set_drive 0.1  [get_ports {a[3]}]
set_drive 0.1  [get_ports {a[2]}]
set_drive 0.1  [get_ports {a[1]}]
set_drive 0.1  [get_ports {a[0]}]
set_drive 0.1  [get_ports valid_i]
