read_verilog -sv /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/public/LSV09_medium_sha256_wishbone/rtl/design.v
hierarchy -check -top Sha256Wishbone
synth -top Sha256Wishbone -flatten -noabc
dfflibmap -liberty /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/lib/nangate45/NangateOpenCellLibrary_typical.lib
abc -liberty /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/lib/nangate45/NangateOpenCellLibrary_typical.lib -script "+strash; balance; rewrite; rewrite -z; balance; rewrite -z; balance; balance; rewrite; rewrite -z; balance; rewrite -z; balance; &get -n; &dch -f; &nf -D 10000; &put"
clean
stat -liberty /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/lib/nangate45/NangateOpenCellLibrary_typical.lib
setundef -zero
splitnets -driver
clean
write_verilog -noattr -noexpr /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/reports/reference_runs/yosys_p4/LSV09/netlist.v
