###################################################################

# Created by write_sdc on Sun Jul  5 14:09:59 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 1 [get_ports {P[0]}]
set_load -pin_load 1 [get_ports {P[1]}]
set_load -pin_load 1 [get_ports {P[2]}]
set_load -pin_load 1 [get_ports {P[3]}]
set_load -pin_load 1 [get_ports {P[4]}]
set_load -pin_load 1 [get_ports {P[5]}]
set_load -pin_load 1 [get_ports {P[6]}]
set_load -pin_load 1 [get_ports F]
create_clock -name virtual_clk  -period 10  -waveform {0 5}
set_max_delay 10  -from [list [get_ports {A[0]}] [get_ports {A[1]}] [get_ports {A[2]}]          \
[get_ports {A[3]}] [get_ports {A[4]}] [get_ports {A[5]}] [get_ports {A[6]}]    \
[get_ports {A[7]}] [get_ports {A[8]}] [get_ports {A[9]}] [get_ports {A[10]}]   \
[get_ports {A[11]}] [get_ports {A[12]}] [get_ports {A[13]}] [get_ports         \
{A[14]}] [get_ports {A[15]}] [get_ports {A[16]}] [get_ports {A[17]}]           \
[get_ports {A[18]}] [get_ports {A[19]}] [get_ports {A[20]}] [get_ports         \
{A[21]}] [get_ports {A[22]}] [get_ports {A[23]}] [get_ports {A[24]}]           \
[get_ports {A[25]}] [get_ports {A[26]}] [get_ports {A[27]}] [get_ports         \
{A[28]}] [get_ports {A[29]}] [get_ports {A[30]}] [get_ports {A[31]}]           \
[get_ports {A[32]}] [get_ports {A[33]}] [get_ports {A[34]}] [get_ports         \
{A[35]}] [get_ports {A[36]}] [get_ports {A[37]}] [get_ports {A[38]}]           \
[get_ports {A[39]}] [get_ports {A[40]}] [get_ports {A[41]}] [get_ports         \
{A[42]}] [get_ports {A[43]}] [get_ports {A[44]}] [get_ports {A[45]}]           \
[get_ports {A[46]}] [get_ports {A[47]}] [get_ports {A[48]}] [get_ports         \
{A[49]}] [get_ports {A[50]}] [get_ports {A[51]}] [get_ports {A[52]}]           \
[get_ports {A[53]}] [get_ports {A[54]}] [get_ports {A[55]}] [get_ports         \
{A[56]}] [get_ports {A[57]}] [get_ports {A[58]}] [get_ports {A[59]}]           \
[get_ports {A[60]}] [get_ports {A[61]}] [get_ports {A[62]}] [get_ports         \
{A[63]}] [get_ports {A[64]}] [get_ports {A[65]}] [get_ports {A[66]}]           \
[get_ports {A[67]}] [get_ports {A[68]}] [get_ports {A[69]}] [get_ports         \
{A[70]}] [get_ports {A[71]}] [get_ports {A[72]}] [get_ports {A[73]}]           \
[get_ports {A[74]}] [get_ports {A[75]}] [get_ports {A[76]}] [get_ports         \
{A[77]}] [get_ports {A[78]}] [get_ports {A[79]}] [get_ports {A[80]}]           \
[get_ports {A[81]}] [get_ports {A[82]}] [get_ports {A[83]}] [get_ports         \
{A[84]}] [get_ports {A[85]}] [get_ports {A[86]}] [get_ports {A[87]}]           \
[get_ports {A[88]}] [get_ports {A[89]}] [get_ports {A[90]}] [get_ports         \
{A[91]}] [get_ports {A[92]}] [get_ports {A[93]}] [get_ports {A[94]}]           \
[get_ports {A[95]}] [get_ports {A[96]}] [get_ports {A[97]}] [get_ports         \
{A[98]}] [get_ports {A[99]}] [get_ports {A[100]}] [get_ports {A[101]}]         \
[get_ports {A[102]}] [get_ports {A[103]}] [get_ports {A[104]}] [get_ports      \
{A[105]}] [get_ports {A[106]}] [get_ports {A[107]}] [get_ports {A[108]}]       \
[get_ports {A[109]}] [get_ports {A[110]}] [get_ports {A[111]}] [get_ports      \
{A[112]}] [get_ports {A[113]}] [get_ports {A[114]}] [get_ports {A[115]}]       \
[get_ports {A[116]}] [get_ports {A[117]}] [get_ports {A[118]}] [get_ports      \
{A[119]}] [get_ports {A[120]}] [get_ports {A[121]}] [get_ports {A[122]}]       \
[get_ports {A[123]}] [get_ports {A[124]}] [get_ports {A[125]}] [get_ports      \
{A[126]}] [get_ports {A[127]}]]  -to [list [get_ports {P[0]}] [get_ports {P[1]}] [get_ports {P[2]}] [get_ports \
{P[3]}] [get_ports {P[4]}] [get_ports {P[5]}] [get_ports {P[6]}] [get_ports    \
F]]
set_input_delay -clock virtual_clk  1  [get_ports {A[0]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[1]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[2]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[3]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[4]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[5]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[6]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[7]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[8]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[9]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[10]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[11]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[12]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[13]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[14]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[15]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[16]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[17]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[18]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[19]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[20]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[21]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[22]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[23]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[24]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[25]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[26]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[27]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[28]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[29]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[30]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[31]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[32]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[33]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[34]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[35]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[36]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[37]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[38]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[39]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[40]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[41]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[42]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[43]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[44]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[45]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[46]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[47]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[48]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[49]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[50]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[51]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[52]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[53]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[54]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[55]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[56]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[57]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[58]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[59]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[60]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[61]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[62]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[63]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[64]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[65]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[66]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[67]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[68]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[69]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[70]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[71]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[72]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[73]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[74]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[75]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[76]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[77]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[78]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[79]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[80]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[81]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[82]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[83]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[84]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[85]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[86]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[87]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[88]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[89]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[90]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[91]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[92]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[93]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[94]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[95]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[96]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[97]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[98]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[99]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[100]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[101]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[102]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[103]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[104]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[105]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[106]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[107]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[108]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[109]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[110]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[111]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[112]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[113]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[114]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[115]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[116]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[117]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[118]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[119]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[120]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[121]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[122]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[123]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[124]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[125]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[126]}]
set_input_delay -clock virtual_clk  1  [get_ports {A[127]}]
set_output_delay -clock virtual_clk  1  [get_ports {P[0]}]
set_output_delay -clock virtual_clk  1  [get_ports {P[1]}]
set_output_delay -clock virtual_clk  1  [get_ports {P[2]}]
set_output_delay -clock virtual_clk  1  [get_ports {P[3]}]
set_output_delay -clock virtual_clk  1  [get_ports {P[4]}]
set_output_delay -clock virtual_clk  1  [get_ports {P[5]}]
set_output_delay -clock virtual_clk  1  [get_ports {P[6]}]
set_output_delay -clock virtual_clk  1  [get_ports F]
set_drive 0.1  [get_ports {A[0]}]
set_drive 0.1  [get_ports {A[1]}]
set_drive 0.1  [get_ports {A[2]}]
set_drive 0.1  [get_ports {A[3]}]
set_drive 0.1  [get_ports {A[4]}]
set_drive 0.1  [get_ports {A[5]}]
set_drive 0.1  [get_ports {A[6]}]
set_drive 0.1  [get_ports {A[7]}]
set_drive 0.1  [get_ports {A[8]}]
set_drive 0.1  [get_ports {A[9]}]
set_drive 0.1  [get_ports {A[10]}]
set_drive 0.1  [get_ports {A[11]}]
set_drive 0.1  [get_ports {A[12]}]
set_drive 0.1  [get_ports {A[13]}]
set_drive 0.1  [get_ports {A[14]}]
set_drive 0.1  [get_ports {A[15]}]
set_drive 0.1  [get_ports {A[16]}]
set_drive 0.1  [get_ports {A[17]}]
set_drive 0.1  [get_ports {A[18]}]
set_drive 0.1  [get_ports {A[19]}]
set_drive 0.1  [get_ports {A[20]}]
set_drive 0.1  [get_ports {A[21]}]
set_drive 0.1  [get_ports {A[22]}]
set_drive 0.1  [get_ports {A[23]}]
set_drive 0.1  [get_ports {A[24]}]
set_drive 0.1  [get_ports {A[25]}]
set_drive 0.1  [get_ports {A[26]}]
set_drive 0.1  [get_ports {A[27]}]
set_drive 0.1  [get_ports {A[28]}]
set_drive 0.1  [get_ports {A[29]}]
set_drive 0.1  [get_ports {A[30]}]
set_drive 0.1  [get_ports {A[31]}]
set_drive 0.1  [get_ports {A[32]}]
set_drive 0.1  [get_ports {A[33]}]
set_drive 0.1  [get_ports {A[34]}]
set_drive 0.1  [get_ports {A[35]}]
set_drive 0.1  [get_ports {A[36]}]
set_drive 0.1  [get_ports {A[37]}]
set_drive 0.1  [get_ports {A[38]}]
set_drive 0.1  [get_ports {A[39]}]
set_drive 0.1  [get_ports {A[40]}]
set_drive 0.1  [get_ports {A[41]}]
set_drive 0.1  [get_ports {A[42]}]
set_drive 0.1  [get_ports {A[43]}]
set_drive 0.1  [get_ports {A[44]}]
set_drive 0.1  [get_ports {A[45]}]
set_drive 0.1  [get_ports {A[46]}]
set_drive 0.1  [get_ports {A[47]}]
set_drive 0.1  [get_ports {A[48]}]
set_drive 0.1  [get_ports {A[49]}]
set_drive 0.1  [get_ports {A[50]}]
set_drive 0.1  [get_ports {A[51]}]
set_drive 0.1  [get_ports {A[52]}]
set_drive 0.1  [get_ports {A[53]}]
set_drive 0.1  [get_ports {A[54]}]
set_drive 0.1  [get_ports {A[55]}]
set_drive 0.1  [get_ports {A[56]}]
set_drive 0.1  [get_ports {A[57]}]
set_drive 0.1  [get_ports {A[58]}]
set_drive 0.1  [get_ports {A[59]}]
set_drive 0.1  [get_ports {A[60]}]
set_drive 0.1  [get_ports {A[61]}]
set_drive 0.1  [get_ports {A[62]}]
set_drive 0.1  [get_ports {A[63]}]
set_drive 0.1  [get_ports {A[64]}]
set_drive 0.1  [get_ports {A[65]}]
set_drive 0.1  [get_ports {A[66]}]
set_drive 0.1  [get_ports {A[67]}]
set_drive 0.1  [get_ports {A[68]}]
set_drive 0.1  [get_ports {A[69]}]
set_drive 0.1  [get_ports {A[70]}]
set_drive 0.1  [get_ports {A[71]}]
set_drive 0.1  [get_ports {A[72]}]
set_drive 0.1  [get_ports {A[73]}]
set_drive 0.1  [get_ports {A[74]}]
set_drive 0.1  [get_ports {A[75]}]
set_drive 0.1  [get_ports {A[76]}]
set_drive 0.1  [get_ports {A[77]}]
set_drive 0.1  [get_ports {A[78]}]
set_drive 0.1  [get_ports {A[79]}]
set_drive 0.1  [get_ports {A[80]}]
set_drive 0.1  [get_ports {A[81]}]
set_drive 0.1  [get_ports {A[82]}]
set_drive 0.1  [get_ports {A[83]}]
set_drive 0.1  [get_ports {A[84]}]
set_drive 0.1  [get_ports {A[85]}]
set_drive 0.1  [get_ports {A[86]}]
set_drive 0.1  [get_ports {A[87]}]
set_drive 0.1  [get_ports {A[88]}]
set_drive 0.1  [get_ports {A[89]}]
set_drive 0.1  [get_ports {A[90]}]
set_drive 0.1  [get_ports {A[91]}]
set_drive 0.1  [get_ports {A[92]}]
set_drive 0.1  [get_ports {A[93]}]
set_drive 0.1  [get_ports {A[94]}]
set_drive 0.1  [get_ports {A[95]}]
set_drive 0.1  [get_ports {A[96]}]
set_drive 0.1  [get_ports {A[97]}]
set_drive 0.1  [get_ports {A[98]}]
set_drive 0.1  [get_ports {A[99]}]
set_drive 0.1  [get_ports {A[100]}]
set_drive 0.1  [get_ports {A[101]}]
set_drive 0.1  [get_ports {A[102]}]
set_drive 0.1  [get_ports {A[103]}]
set_drive 0.1  [get_ports {A[104]}]
set_drive 0.1  [get_ports {A[105]}]
set_drive 0.1  [get_ports {A[106]}]
set_drive 0.1  [get_ports {A[107]}]
set_drive 0.1  [get_ports {A[108]}]
set_drive 0.1  [get_ports {A[109]}]
set_drive 0.1  [get_ports {A[110]}]
set_drive 0.1  [get_ports {A[111]}]
set_drive 0.1  [get_ports {A[112]}]
set_drive 0.1  [get_ports {A[113]}]
set_drive 0.1  [get_ports {A[114]}]
set_drive 0.1  [get_ports {A[115]}]
set_drive 0.1  [get_ports {A[116]}]
set_drive 0.1  [get_ports {A[117]}]
set_drive 0.1  [get_ports {A[118]}]
set_drive 0.1  [get_ports {A[119]}]
set_drive 0.1  [get_ports {A[120]}]
set_drive 0.1  [get_ports {A[121]}]
set_drive 0.1  [get_ports {A[122]}]
set_drive 0.1  [get_ports {A[123]}]
set_drive 0.1  [get_ports {A[124]}]
set_drive 0.1  [get_ports {A[125]}]
set_drive 0.1  [get_ports {A[126]}]
set_drive 0.1  [get_ports {A[127]}]
