###################################################################

# Created by write_sdc on Sun Jul  5 15:02:08 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_area 0
set_load -pin_load 1 [get_ports io_bus_ack]
set_load -pin_load 1 [get_ports io_bus_err]
set_load -pin_load 1 [get_ports {io_bus_data_rd[31]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[30]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[29]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[28]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[27]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[26]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[25]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[24]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[23]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[22]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[21]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[20]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[19]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[18]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[17]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[16]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[15]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[14]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[13]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[12]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[11]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[10]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[9]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[8]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[7]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[6]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[5]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[4]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[3]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[2]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[1]}]
set_load -pin_load 1 [get_ports {io_bus_data_rd[0]}]
create_clock [get_ports clock]  -period 100  -waveform {0 50}
set_false_path   -from [get_ports reset]
set_input_delay -clock clock  1  [get_ports clock]
set_input_delay -clock clock  1  [get_ports reset]
set_input_delay -clock clock  1  [get_ports io_bus_cyc]
set_input_delay -clock clock  1  [get_ports io_bus_stb]
set_input_delay -clock clock  1  [get_ports io_bus_we]
set_input_delay -clock clock  1  [get_ports {io_bus_sel[3]}]
set_input_delay -clock clock  1  [get_ports {io_bus_sel[2]}]
set_input_delay -clock clock  1  [get_ports {io_bus_sel[1]}]
set_input_delay -clock clock  1  [get_ports {io_bus_sel[0]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[31]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[30]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[29]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[28]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[27]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[26]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[25]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[24]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[23]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[22]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[21]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[20]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[19]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[18]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[17]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[16]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[15]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[14]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[13]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[12]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[11]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[10]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[9]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[8]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[7]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[6]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[5]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[4]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[3]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[2]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[1]}]
set_input_delay -clock clock  1  [get_ports {io_bus_addr[0]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[31]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[30]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[29]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[28]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[27]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[26]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[25]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[24]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[23]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[22]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[21]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[20]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[19]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[18]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[17]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[16]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[15]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[14]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[13]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[12]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[11]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[10]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[9]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[8]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[7]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[6]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[5]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[4]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[3]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[2]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[1]}]
set_input_delay -clock clock  1  [get_ports {io_bus_data_wr[0]}]
set_output_delay -clock clock  1  [get_ports io_bus_ack]
set_output_delay -clock clock  1  [get_ports io_bus_err]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[31]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[30]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[29]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[28]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[27]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[26]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[25]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[24]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[23]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[22]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[21]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[20]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[19]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[18]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[17]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[16]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[15]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[14]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[13]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[12]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[11]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[10]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[9]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[8]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[7]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[6]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[5]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[4]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[3]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[2]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[1]}]
set_output_delay -clock clock  1  [get_ports {io_bus_data_rd[0]}]
set_drive 0.1  [get_ports clock]
set_drive 0.1  [get_ports reset]
set_drive 0.1  [get_ports io_bus_cyc]
set_drive 0.1  [get_ports io_bus_stb]
set_drive 0.1  [get_ports io_bus_we]
set_drive 0.1  [get_ports {io_bus_sel[3]}]
set_drive 0.1  [get_ports {io_bus_sel[2]}]
set_drive 0.1  [get_ports {io_bus_sel[1]}]
set_drive 0.1  [get_ports {io_bus_sel[0]}]
set_drive 0.1  [get_ports {io_bus_addr[31]}]
set_drive 0.1  [get_ports {io_bus_addr[30]}]
set_drive 0.1  [get_ports {io_bus_addr[29]}]
set_drive 0.1  [get_ports {io_bus_addr[28]}]
set_drive 0.1  [get_ports {io_bus_addr[27]}]
set_drive 0.1  [get_ports {io_bus_addr[26]}]
set_drive 0.1  [get_ports {io_bus_addr[25]}]
set_drive 0.1  [get_ports {io_bus_addr[24]}]
set_drive 0.1  [get_ports {io_bus_addr[23]}]
set_drive 0.1  [get_ports {io_bus_addr[22]}]
set_drive 0.1  [get_ports {io_bus_addr[21]}]
set_drive 0.1  [get_ports {io_bus_addr[20]}]
set_drive 0.1  [get_ports {io_bus_addr[19]}]
set_drive 0.1  [get_ports {io_bus_addr[18]}]
set_drive 0.1  [get_ports {io_bus_addr[17]}]
set_drive 0.1  [get_ports {io_bus_addr[16]}]
set_drive 0.1  [get_ports {io_bus_addr[15]}]
set_drive 0.1  [get_ports {io_bus_addr[14]}]
set_drive 0.1  [get_ports {io_bus_addr[13]}]
set_drive 0.1  [get_ports {io_bus_addr[12]}]
set_drive 0.1  [get_ports {io_bus_addr[11]}]
set_drive 0.1  [get_ports {io_bus_addr[10]}]
set_drive 0.1  [get_ports {io_bus_addr[9]}]
set_drive 0.1  [get_ports {io_bus_addr[8]}]
set_drive 0.1  [get_ports {io_bus_addr[7]}]
set_drive 0.1  [get_ports {io_bus_addr[6]}]
set_drive 0.1  [get_ports {io_bus_addr[5]}]
set_drive 0.1  [get_ports {io_bus_addr[4]}]
set_drive 0.1  [get_ports {io_bus_addr[3]}]
set_drive 0.1  [get_ports {io_bus_addr[2]}]
set_drive 0.1  [get_ports {io_bus_addr[1]}]
set_drive 0.1  [get_ports {io_bus_addr[0]}]
set_drive 0.1  [get_ports {io_bus_data_wr[31]}]
set_drive 0.1  [get_ports {io_bus_data_wr[30]}]
set_drive 0.1  [get_ports {io_bus_data_wr[29]}]
set_drive 0.1  [get_ports {io_bus_data_wr[28]}]
set_drive 0.1  [get_ports {io_bus_data_wr[27]}]
set_drive 0.1  [get_ports {io_bus_data_wr[26]}]
set_drive 0.1  [get_ports {io_bus_data_wr[25]}]
set_drive 0.1  [get_ports {io_bus_data_wr[24]}]
set_drive 0.1  [get_ports {io_bus_data_wr[23]}]
set_drive 0.1  [get_ports {io_bus_data_wr[22]}]
set_drive 0.1  [get_ports {io_bus_data_wr[21]}]
set_drive 0.1  [get_ports {io_bus_data_wr[20]}]
set_drive 0.1  [get_ports {io_bus_data_wr[19]}]
set_drive 0.1  [get_ports {io_bus_data_wr[18]}]
set_drive 0.1  [get_ports {io_bus_data_wr[17]}]
set_drive 0.1  [get_ports {io_bus_data_wr[16]}]
set_drive 0.1  [get_ports {io_bus_data_wr[15]}]
set_drive 0.1  [get_ports {io_bus_data_wr[14]}]
set_drive 0.1  [get_ports {io_bus_data_wr[13]}]
set_drive 0.1  [get_ports {io_bus_data_wr[12]}]
set_drive 0.1  [get_ports {io_bus_data_wr[11]}]
set_drive 0.1  [get_ports {io_bus_data_wr[10]}]
set_drive 0.1  [get_ports {io_bus_data_wr[9]}]
set_drive 0.1  [get_ports {io_bus_data_wr[8]}]
set_drive 0.1  [get_ports {io_bus_data_wr[7]}]
set_drive 0.1  [get_ports {io_bus_data_wr[6]}]
set_drive 0.1  [get_ports {io_bus_data_wr[5]}]
set_drive 0.1  [get_ports {io_bus_data_wr[4]}]
set_drive 0.1  [get_ports {io_bus_data_wr[3]}]
set_drive 0.1  [get_ports {io_bus_data_wr[2]}]
set_drive 0.1  [get_ports {io_bus_data_wr[1]}]
set_drive 0.1  [get_ports {io_bus_data_wr[0]}]
