read_verilog -sv /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/public/LSV05_sog_axi_downsizer/rtl/design.v
hierarchy -check -top axi_dwidth_converter_v2_1_b_downsizer
synth -top axi_dwidth_converter_v2_1_b_downsizer -flatten -noabc
dfflibmap -liberty /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/lib/nangate45/NangateOpenCellLibrary_typical.lib
abc -liberty /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/lib/nangate45/NangateOpenCellLibrary_typical.lib -script "+strash; balance; rewrite; rewrite -z; balance; rewrite -z; balance; &get -n; &dch -f; &nf -D 10000; &put"
clean
stat -liberty /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/lib/nangate45/NangateOpenCellLibrary_typical.lib
setundef -zero
splitnets -driver
clean
write_verilog -noattr -noexpr /data0/home/sunbin/workspace/constrain_sensor/raw_data/logic_synthesis_question_bank/reports/reference_runs/yosys_p1/LSV05/netlist.v
